
* Problem 8

Group items from bag so that they would balance on a scale. Bags have
size 2-20, which means we don't have to be smart about this.

#+begin_src j :session :exports both :sit 0.3
balancing=: (1+i.3);(1+i.11);10 81 98 27 28 5 1 46 63 99 25 39 84 87 76 85 78 64 41 93; 13 , 13#1
notbalancing=: 90 44 76 48 41 50 9 69 30 74 15 56 28 31 52 97 81 78 22 34;1+i.5
Balance=: (</.~)"1 [: #: [: I. ([: -: +/) = [: +/"1 (*"_ 1 #: @ i. @ (2^#))
({. @ Balance) &> balancing
Balance &.> notbalancing
#+end_src

#+RESULTS:
#+begin_example
┌────────────────────────────────────┬─────────────────────────┐
│1 2                                 │3                        │
├────────────────────────────────────┼─────────────────────────┤
│1 2 3 4 5 7 11                      │6 8 9 10                 │
├────────────────────────────────────┼─────────────────────────┤
│10 81 98 27 28 5 1 46 63 25 39 78 64│99 84 87 76 85 41 93     │
├────────────────────────────────────┼─────────────────────────┤
│13                                  │1 1 1 1 1 1 1 1 1 1 1 1 1│
└────────────────────────────────────┴─────────────────────────┘

┌┬┐
│││
└┴┘
#+end_example
